# Learning Agenda of this Notebook:
- What is Pandas and how is it used in AI?
- Key features of Pandas
- Data Types in Pandas
- What does Pandas deal with?

- Creating Series in Pandas
    - From Python List
    - From NumPy Arrays
    - From Python Dictionary
    - From a scalar value
    - Creating empty series object
- Attributes of a Pandas Series
- Arithmetic Operations on Series

- Dataframes in Pandas
    - Anatomy of a Dataframe
    - Creating Dataframe
        - An empty dataframe
        - Two-Dimensional NumPy Array
        - Dictionary of Python Lists
        - Dictionary of Panda Series
    - Attributes of a Dataframe
    - Bonus
- Different file formats in Pandas 
- Indexing, Subsetting and Slicing Dataframes
- Data Handling with Pandas
  - Practice Exercise I
  - Practice Exercise II
- All Statistical functions in Pandas
- Input/Output Operations
- Aggregation & Grouping
  - Practice Exercise
- Merging, Joining and Concatenation
  - Practice Exercise
- How To Perform Data Visualization with Pandas
- Exercise I
- Exercise II
- Pandas's Assignment

## Indexing, Subsetting and Slicing Dataframes

### Motivation:
- The ability to select specific rows and columns to access and filter data based on specific conditions are two of the key features of Pandas.
    - **Selection** allows you to access specific rows or columns (a subset) of the data by their index and/or location in the DataFrame
        - In large datasets, you may be required to select the first/last N records
        - In large datasets, you may be required to select a range (n to m) of records
        - In large datasets, you may be required to select specific columns of your interest
        - In large datasets, you may be required to select specific range and specific columns of your interest
    - **Filtering** allows you to access specific rows or columns (a subset) of the data based on one or more conditions
        - In a medical dataset, you may be required to filter record of all those patients who suffer with a specific disease, or who have a specific blood group
        - In a medical dataset, you may be required to filter pregnant women who have anemia, and compare this subset to women who donâ€™t have anemia.
        - In a travel dataset, you may be required to filter hotels inside Lahore city, sorted by their minimum per day cost
        - In a client dataset, you may be required filter the clients who use a Gmail account(may require a string filter)
        - In a client dataset, you may be required to filter the clients who belong to a specific countries (may require use of .isin() function)

### Outline
1. Understanding Indices of a Dataframe
    - Understand the Dataset
    - Changing the Column Indices of a Dataframe
    - Changing the Row Indices of a Dataframe
2. Selecting Row(s) and Column(s) of a Dataframe using `df[]` 
3. Selecting Rows and Columns using `iloc` Method
4. Selecting Rows and Columns using `loc` Method
5. Conditional Selection   
6. Selecting columns of a specific data type

In [ ]:
# df[], df.iloc[] -> work for positional indexing
# df.loc[] -> work for label indexing

### Understanding Indices of a Dataframe

<img align="right" width="300" height="300"  src="images/series-anatomy.png">

<img align="left" width="500" height="500"  src="images/dataframe.jpg">

#### Series:

- We have seen a series is a an object like a 1d array capable of holding a sequence of values of any data type.
- Every data value of series has an explicit row index associated with it ,which can be a numeric value as well as a string. 
- We have also seen that we can use these indices for three purposes for accessing the elements ,for subsetting or slicing purposes.

#### DataFrame:
- Dataframe is a 2d labeled data structure so it has two indices. A row index that moves from top to bottom is associated with rows of a dataframe and a column index that moves from left to right is associated with the columns of a dataframe. By default the row indices starts from 0 and ends at n-1 where n is the total number of rows in a dataframe and this is actually an integer identifier for the rows similarly the column indices by default also starts from 0 and ends at n-1 where n is the total number of columns in a data frame and this is actually an integer identifier for the columns.

### Understand the Dataset
- Let us first understand the dataframe on which we are going to work in today's notebook

In [2]:
import numpy as np
import pandas as pd
df = pd.read_csv('datasets/groupdata.csv')
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

#### All attributes of the dataframe

In [4]:
df.shape # rows and columns of the dataframe

(16, 10)

In [5]:
df.dtypes # data type of each column

roll no          int64
name            object
age              int64
address         object
session         object
group           object
gender          object
subj1          float64
subj2          float64
scholarship    float64
dtype: object

In [6]:
df.isnull().sum() # number of null values in each column

roll no        0
name           0
age            0
address        0
session        0
group          0
gender         0
subj1          1
subj2          1
scholarship    2
dtype: int64

In [7]:
df.isna().sum() # number of null values in each column

roll no        0
name           0
age            0
address        0
session        0
group          0
gender         0
subj1          1
subj2          1
scholarship    2
dtype: int64

In [8]:
df.columns # column names

Index(['roll no', 'name', 'age', 'address', 'session', 'group', 'gender',
       'subj1', 'subj2', 'scholarship'],
      dtype='object')

In [9]:
df.index # row indexes

RangeIndex(start=0, stop=16, step=1)

In [10]:
df.info() # information about the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   roll no      16 non-null     int64
 1   name         16 non-null     object
 2   age          16 non-null     int64
 3   address      16 non-null     object
 4   session      16 non-null     object
 5   group        16 non-null     object
 6   gender       16 non-null     object
 7   subj1        15 non-null     float64
 8   subj2        15 non-null     float64
 9   scholarship  14 non-null     float64
dtypes: float64(3), int64(2), object(5)
memory usage: 1.4+ KB

In [11]:
df.describe() # statistical summary and descriptive statistics

         roll no        age      subj1      subj2  scholarship
count  16.000000  16.000000  15.000000  15.000000    14.000000
mean    8.500000  16.687500  82.153333  78.133333  5328.571429
std     4.760952   5.641734   9.885261   5.964378  1888.600854
min     1.000000   4.000000  64.900000  60.500000  3500.000000
25%     4.750000  12.750000  74.400000  76.000000  3800.000000
50%     8.500000  17.000000  84.100000  81.300000  4500.000000
75%    12.250000  20.000000  90.500000  81.300000  6750.000000
max    16.000000  28.000000  90.500000  84.400000  8500.000000

In [12]:
df['age'].describe()

count    16.000000
mean     16.687500
std       5.641734
min       4.000000
25%      12.750000
50%      17.000000
75%      20.000000
max      28.000000
Name: age, dtype: float64

In [14]:
df['session'].value_counts()

session
AFT          5
AFTERNOON    5
MORNING      4
MOR          2
Name: count, dtype: int64

#### Changing the Column Indices/Labels of a Datarame
- Every dataframe has column labels associated with its columns
- These by default are integer values from 0,1,2,3...
- However, while creating a dataframe from scratch, or while reading them from a file you can set them to more meaningful string values.
- While reading from csv file the first row in the file is taken as the column labels
- We can change the column labels, if we want.


**rename method**

##### Changing the Column indices while reading the dataframe
- `pd.read_csv('datasets/groupdata.csv', names=['roll no', 'name', 'age', 'marks'])`

##### Changing the Column indices after reading the data/dataframe
- `df.columns = ['roll no', 'name', 'age', 'marks']`

In [15]:
df.columns

Index(['roll no', 'name', 'age', 'address', 'session', 'group', 'gender',
       'subj1', 'subj2', 'scholarship'],
      dtype='object')

In [16]:
df.rename(columns={'roll no': 'rollno'}).head()
# columns parameter is a dictionary, 
# key is the old column name and value is the new column name

,rollno,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0

In [17]:
df.rename(columns={'roll no': 'rollno', 'subj1': 'python programming', 'subj2': 'statistics'}).head()

,rollno,name,age,address,session,group,gender,python programming,statistics,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0

### Changing the Row Indices/Labels of a  Dataframe
- Every dataframe has row index associated with its rows
- These by default are integer values from 0,1,2,3...
- However, while creating a dataframe from scratch you may set them to some meaningful string values (seldom required).
- We have already seen this in our previous session
- Today, we will see two methods that work on row indices of a Pandas Dataframe named `df.set_index()` and `df.reset_index()`

In [18]:
# change the row indexes
df.index

RangeIndex(start=0, stop=16, step=1)

In [19]:
# x=2
# x=4
df.index = ['r1', 'r2', 'r3', 'r4', 'r5', 'r6', 'r7', 'r8', 'r9', 'r10', 'r11', 'r12', 'r13', 'r14', 'r15' , 'r16']

In [20]:
df.head()

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
r1,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
r2,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
r3,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
r4,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
r5,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0

In [22]:
# sort_values
# sort_index
# set_index

**Changing Row Indices:** The `df.set_index()` method can be used to change row index of a dataframe using an existing column(s)
`df.set_index(keys, drop=True, append=False, inplace=False, verify_integrity=False)`

- Where
    - `keys` is the column label 
    - `drop=True`, to drop the column from data part of dataframe that is being used as column index now
    - `append=False`, Set it to True if you want to append columns to existing index
    - `inplace=False`, Set it to True to make changes in the original dataframe, i.e., do not create a new object
    - `verify_integrity=False`, Set it to True to check the new index for duplicates. Default value of False will improve the performance of this method.

Returns Dataframe if `inplace=False` or None if `inplace=True`

In [23]:
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
r1,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
r2,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
r3,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
r4,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
r5,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
r6,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
r7,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
r8,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
r9,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
r10,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
r11,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
r12,12,Muskan,20,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
r13,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
r14,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
r15,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
r16,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [25]:
df1 = df.set_index(keys='roll no', drop=False)
df1.head(10)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
roll no,,,,,,,,,,
1,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
2,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
3,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
4,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
5,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
6,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
7,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
8,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
9,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
10,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0

> **Note:** The rollno column still exist as part of the dataframe. To drop it set `drop=True`

In [26]:
df1 = df.set_index(keys='roll no', drop=True)
df1.head(10)

,name,age,address,session,group,gender,subj1,subj2,scholarship
roll no,,,,,,,,,
1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0

Another point to note is that no change has been made to the original dataframe since `inplace` arguement is by default False. Let us verify this

In [27]:
df.head(3)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
r1,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
r2,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
r3,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

Instead of returning a dataframe, the `df.set_index()` method can change the column index inplace. Let us do that now

In [28]:
df.set_index(keys='roll no', drop=True, inplace=True)

In [29]:
df.head()

,name,age,address,session,group,gender,subj1,subj2,scholarship
roll no,,,,,,,,,
1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0

>Note that the roll no column has become the index now, it is no more data of the dataframe

**Changing Row Indices Back to Positional:** The `df.reset_index()` method is used to reset the row index of the dataframe back to positional integer indices

`df.reset_index(drop=False, inplace=False)`
Where
- `drop=False`, Do not try to insert index into dataframe columns. This resets the index to the default integer index.
- `inplace=False`,  Modify the DataFrame in place (do not create a new object).

Returns Dataframe if `inplace=False` or None if `inplace=True`

In [30]:
df.head()

,name,age,address,session,group,gender,subj1,subj2,scholarship
roll no,,,,,,,,,
1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0

In [31]:
df.shape

(16, 9)

In [32]:
# reset the index
df2 = df.reset_index()
df2

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [33]:
df2.head(3)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0

In [34]:
df

,name,age,address,session,group,gender,subj1,subj2,scholarship
roll no,,,,,,,,,
1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
12,Muskan,20,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [35]:
df3 = df.reset_index(drop=True)

In [36]:
df3.head()

,name,age,address,session,group,gender,subj1,subj2,scholarship
0,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0

## Selecting Column(s) and Row(s) of a Dataframe using `df[]` 


- Consider this dataframe which is sorted by ages. Note the row indices has been randomized and they do not correspond to positional indices (which we normally visualize as 0,1,2,3...)
- To access column(s) of a dataframe:
    - To access single column, mention the column index/label inside `[]`, which in this case are strings, however, can be integer values as well. It will return a new Series object.
    - To access multiple columns, pass column indices/labels as a list inside `[]`. It will return a new Dataframe object.
- To access rows(s) of a dataframe:    
    - Mention the **positional** row indices as a slice object `[start:stop:step]`, (In this case the positional indices do not match with the actual row indices). It will return a new Dataframe object.
        - `start`: specifies from where the slicing should start, inclusive (default is 0) 
        - `stop`: specifies where it has to stop, exclusive (default is end of the array) 
        - `step`:  is by-default 1
    
    
**Note:** 
- You cannot use two subscript operators `df[2][5]` to access a specific element of a dataframe as in case of numPy arrays.
- You cannot get the subset of a dataframe w.r.t rows and columns at the same time using `df[]`, it can either return a subset of columns only or rows only.
- We will soon see the `df.loc[]` and `df.iloc[]` methods that provides simpler, elegant and powerful way to subset a dataframe as compared to `df[]` syntax.

In [40]:
import pandas as pd

In [41]:
# Let us read a fresh dataframe and sort it by age column to have a clear understanding about indexing
df = pd.read_csv('datasets/groupdata.csv')
df.head()

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0

In [43]:
df['age'] # df.age

0     23
1     16
2     20
3     20
4     21
5     16
6     12
7      4
8     18
9     15
10    12
11    20
12    18
13    28
14    13
15    11
Name: age, dtype: int64

In [44]:
df_sorted = df.sort_values('age')
df_sorted

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
7,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
8,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

In [45]:
df_sorted[1:3] # works for positional indexing

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0

**Example 1:** Select the data under the column `name`. Since the column labels are strings, so we mention it in single quotes.

In [46]:
s1 = df_sorted['name']
print(s1)
type(s1)

7        Adeen
15         Dua
6         Omar
10     Hussein
14     Khubaib
9       Hassan
1       Ayesha
5      Khadija
8       Zainab
12       Yusuf
2          Ali
3        Aisha
11      Muskan
4        Ahmed
0     Ehtisham
13       Amina
Name: name, dtype: object

pandas.core.series.Series

> The result is a new Series object. Since this is a series, so you can use many of the methods that you can use on Pandas Series and Dataframes, in a chained format, as shown below

In [47]:
s1.head() # s1 is a series
# or
df['name'].head() # df is a dataframe

0    Ehtisham
1      Ayesha
2         Ali
3       Aisha
4       Ahmed
Name: name, dtype: object

**Example 2:** To select multiple columns of a dataframe, pass a list of column names. The result is a new DataFrame object with the selected columns.

In [48]:
# Just get the first five rows for the columns `roll no`, `gender` and `age`
d1 = df_sorted[['roll no', 'gender', 'age']].head()
d1

    roll no  gender  age
7         8    Male    4
15       16    Male   11
6         7  Female   12
10       11    Male   12
14       15  Female   13

**Example 3:** Select the data of a single row at position 1.

In [49]:
df_sorted[1:2:1]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

**Example 4:** Select the rows from positional index 2 to 3.

In [50]:
df_sorted[2:4]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0

**Example 5:** Select the rows from positional index 0, 5, 10, and 15

In [51]:
df_sorted[::5]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
7,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

>Note that the output dataframe contains a subset of original dataframe. However, the index or row labels stays with the rows. It is not renumbered. So this means that every row is identified by a row label, which remain associated wih the row or record until you decide to reset the index

#### Resetting the Index of Subset of a Dataframe
- When we slice data from a datafeame, the row index of resulting dataframe may not be contiguous values.
- You can reset it using the `df.reset_index()` method discussed above as well.

In [52]:
df2 = df_sorted[5:12:2]
df2

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0

In [53]:
df3 = df2.reset_index()
df3

,index,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
1,5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
2,12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
3,3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0

>Note that the index has been reset, however, the old index is now added as a column in the dataframe. Mostly this is not required, so pass the `drop=True` argument to `reset_index()` method to avoid this.

In [54]:
df4 = df2.reset_index(drop=True)
df4

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
1,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
2,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0

## Selecting Rows and Columns using `iloc` Method

- The **`df.iloc[]`** is more powerful than the **`df[]`**, as it allows to filter rows as well as columns of user choice at the same time.
- It is used for filtering rows and selecting columns by **integer position** (0 to n-1) (neither by row index value/label nor by column index value/label). So you cannot mention the column names like `age` rather you need to give its positional index and that is 2.
```
df.iloc[rowstoselect, colstoselect]
```
- You can place a collon in any of the two arguments to select all rows or all columns.
- Another point to keep in mind is that the indices are by position (0 to n-1) and not by actual values of row and column indices. 
- Allowed inputs within `[ , ]` are:
     - A single integer, e.g. ``5`` (note that ``5`` is interpreted as an integer position along the index).
     - A list or array of integers, e.g.  `[9, 2, 7]`.
     - A slice object with integers, e.g. ``2:9``.
     - Note that as with usual Python slices, **stop** index is not included
     - **Note:** ``.iloc`` will raise ``IndexError`` if a requested indexer is out-of-bounds, except *slice* indexers which allow out-of-bounds indexing (this conforms with python/numpy *slice* semantics).

In [3]:
# Let us read a fresh dataframe and sort it by age column to have a clear understanding about indexing
import pandas as pd
df = pd.read_csv('datasets/groupdata.csv')
df_sorted = df.sort_values('age')
df_sorted.head()

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
7,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0

### Rows Selection Only

**Example 1:** Select a single row with positional index  2 and all the columns

In [4]:
df_sorted.iloc[2:3,:]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0

> Note that the integer values are interpreted as row# (positional index) of the dataframe. Moreover a Series object is returned

**Example 2:** Select rows with positional indices 2, 4 and 1 and all the columns.

In [57]:
df_sorted

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
7,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
8,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

In [58]:
df_sorted.iloc[[2,4,1], :]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

**Example 3:** Select rows with positional indices from 3 to 5 (stop value is not inclusive) and all the columns

In [60]:
df_sorted.iloc[3:5, :]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0

In [61]:
df_sorted.iloc[3:5]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0

>**In all above examples, if you omit comma and collon for the columns part, Pandas assumes it. I strongly recommend using the above style for clarity of code.**

###  Selection of Columns Only

In [62]:
df_sorted.columns

Index(['roll no', 'name', 'age', 'address', 'session', 'group', 'gender',
       'subj1', 'subj2', 'scholarship'],
      dtype='object')

**Example 1:** Select all the row values under the column at positional index 3

In [63]:
df_sorted.iloc[:,3]

7        Multan
15       Multan
6       Sialkot
10    Islamabad
14      Sialkot
9        Lahore
1     Islamabad
5        Lahore
8       Karachi
12       Lahore
2       Karachi
3        Lahore
11      Karachi
4      Peshawer
0        Lahore
13       Multan
Name: address, dtype: object

**Example 2:** Select all the row values under the column at positional index 1, 4, and 5

In [64]:
df_sorted.iloc[:, [1,4,5]]

        name    session    group
7      Adeen    MORNING  group D
15       Dua  AFTERNOON  group A
6       Omar        AFT  group B
10   Hussein        MOR  group B
14   Khubaib        AFT  group C
9     Hassan  AFTERNOON  group D
1     Ayesha        AFT  group A
5    Khadija    MORNING  group C
8     Zainab        AFT  group C
12     Yusuf    MORNING  group D
2        Ali  AFTERNOON  group B
3      Aisha        MOR  group A
11    Muskan  AFTERNOON  group C
4      Ahmed        AFT  group D
0   Ehtisham    MORNING  group C
13     Amina  AFTERNOON  group A

###  Selection of Rows + Columns
```
df.iloc[whatrowsIwant, whatcolumnsIwant]
```
- You can use a single value, a list of multiple values, or a slice object for selecting rows
- You can use a single value, a list of multiple values, or a slice object for selecting columns

**Example 1:** Select only the rows at positional index 3 and 0, and from those two rows select only columns at positional index 1 and 5

In [65]:
df_sorted.iloc[[3, 0], [1, 5]]

       name    group
10  Hussein  group B
7     Adeen  group D

**Example 2:** Select only the rows at positional index 0 to 4 (stop index is not inclusive), and from those two rows select only columns at positional index 2 and 3

In [66]:
df_sorted.iloc[0:5, 2:4]

    age    address
7     4     Multan
15   11     Multan
6    12    Sialkot
10   12  Islamabad
14   13    Sialkot

## Selecting Rows and Columns using `df.loc[]` Method

- The **`df.loc[]`** is also used for filtering rows and selecting columns but by row index value/label or by column index value/label (NOT by position). 
```
df.loc[rowstoselect, colstoselect]
```
- You can place a collon in any of the two arguments to select all rows or all columns.
- Another point to keep in mind is that the indices are NOT by position, rather by actual values of row and column indices. 
- Allowed inputs within `[ , ]` are:
     - A single label, e.g. `5` or `'a'`, (note that `5` is interpreted as actual index/label **NOT** as an integer position along the index).
     - A list or array of labels, e.g. `[9, 2, 7]`
     - A slice object with labels, e.g. `[3:6:2]` 
     - **Warning:** Note that contrary to usual Python slices, **both** the start and the stop are included

In [5]:
# Let us read a fresh dataframe and sort it by age column to have a clear understanding about indexing
import pandas as pd
df = pd.read_csv('datasets/groupdata.csv')
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [6]:
df_sorted = df.sort_values('age')
df_sorted

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
7,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
8,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

In [7]:
df_sorted.loc[7,:]

roll no              8
name             Adeen
age                  4
address         Multan
session        MORNING
group          group D
gender            Male
subj1             84.1
subj2             76.0
scholarship     8000.0
Name: 7, dtype: object

**Example:** Select rows with row indices 2, 4 and 1 and all the columns

In [8]:
df_sorted.loc[[2,4,1], :]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0

In [9]:
df_sorted.iloc[[2,4,1], :]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

**Example:** Select all the row values under the columns with labels `name`, `address`, and `scholarship`

In [10]:
df_sorted.loc[:, ['name', 'address', 'scholarship']]

        name    address  scholarship
7      Adeen     Multan       8000.0
15       Dua     Multan       3800.0
6       Omar    Sialkot       4000.0
10   Hussein  Islamabad       6000.0
14   Khubaib    Sialkot       3500.0
9     Hassan     Lahore       3800.0
1     Ayesha  Islamabad       6000.0
5    Khadija     Lahore          NaN
8     Zainab    Karachi       3500.0
12     Yusuf     Lahore       7000.0
2        Ali    Karachi       8500.0
3      Aisha     Lahore       4000.0
11    Muskan    Karachi          NaN
4      Ahmed   Peshawer       3500.0
0   Ehtisham     Lahore       5000.0
13     Amina     Multan       8000.0

**Example:** Select rows with row indices 0 to 5 (Stop index is inclusive), and from those six rows select columns `name`, `age` and `session`

In [14]:
df_sorted.loc[0:5, ['name', 'age', 'session']]

       name  age  session
5   Khadija   16  MORNING
8    Zainab   18      AFT
12    Yusuf   18  MORNING

In [11]:
df_sorted.loc[4:0, ['name', 'age', 'session']]

       name  age  session
4     Ahmed   21      AFT
0  Ehtisham   23  MORNING

In [15]:
df_sorted.loc[3:13, ['name', 'age', 'session']]

        name  age    session
3      Aisha   20        MOR
11    Muskan   20  AFTERNOON
4      Ahmed   21        AFT
0   Ehtisham   23    MORNING
13     Amina   28  AFTERNOON

>**Always keep the row indices of your dataframe as 0, 1, 2, 3, 4, ... and the column indices as meaningful labels. If after a slicing or sorting operation, the row indices are a bit disturbed, use `df.reset_index()` method to adjust your row indices match the positional indices.**

## Conditional Selection
- Suppose we want to select only those rows where the age value is greater than 20. Note this time the dataframe has row indices that match with the positional indices.

In [16]:
# Let us read a fresh dataframe and sort it by age column to have a clear understanding about indexing
import pandas as pd
df = pd.read_csv('datasets/groupdata.csv')
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

###  Option 1:
- Create a Python list having Boolean values of exact same length as the rows of the dataframe 
- The value in the list need to be True for the row which we want to select
- Convert the Python list to a Pandas series
- Finally pass that series to the dataframe

In [17]:
df.age # df['age']

0     23
1     16
2     20
3     20
4     21
5     16
6     12
7      4
8     18
9     15
10    12
11    20
12    18
13    28
14    13
15    11
Name: age, dtype: int64

In [18]:
list1 = []
for length in df.age:
    if length > 20:
        list1.append(True)
    else:
        list1.append(False)
list1

[True,
 False,
 False,
 False,
 True,
 False,
 False,
 False,
 False,
 False,
 False,
 False,
 False,
 True,
 False,
 False]

In [19]:
print(list1)
print(f"Length of list1 is {len(list1)}")
print(f"Length of dataframe is {len(df)}")

[True, False, False, False, True, False, False, False, False, False, False, False, False, True, False, False]
Length of list1 is 16
Length of dataframe is 16

In [20]:
df[list1] # masking of True and False

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

###  Option 2:
- Instead of creating a Boolean list using the loop, use the condition inside the `df[cond]` operator, that will automatically generate the Boolean list.

In [21]:
df.age > 20

0      True
1     False
2     False
3     False
4      True
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13     True
14    False
15    False
Name: age, dtype: bool

In [22]:
df[df.age > 20]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

In [23]:
df[df['age'] > 20]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

### Option 3:
- Best way is to use the **`df.loc[cond]`** method.

In [24]:
df.loc[df['age'] > 20, :]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

In [25]:
# Using 'loc' gives you the facility to slice the required columns as well
df.loc[df['age'] > 20, ['name', 'age']]

        name  age
0   Ehtisham   23
4      Ahmed   21
13     Amina   28

# Bonus

In [28]:
df1 = pd.read_csv("datasets/Euro_2012_stats_TEAM.csv")
df1

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
0,Croatia,4,13,12,51.9%,16.0%,32,0,0,0,...,13,81.3%,41,62,2,9,0,9,9,16
1,Czech Republic,4,13,18,41.9%,12.9%,39,0,0,0,...,9,60.1%,53,73,8,7,0,11,11,19
2,Denmark,4,10,10,50.0%,20.0%,27,1,0,0,...,10,66.7%,25,38,8,4,0,7,7,15
3,England,5,11,18,50.0%,17.2%,40,0,0,0,...,22,88.1%,43,45,6,5,0,11,11,16
4,France,3,22,24,37.9%,6.5%,65,1,0,0,...,6,54.6%,36,51,5,6,0,11,11,19
5,Germany,10,32,32,47.8%,15.6%,80,2,1,0,...,10,62.6%,63,49,12,4,0,15,15,17
6,Greece,5,8,18,30.7%,19.2%,32,1,1,1,...,13,65.1%,67,48,12,9,1,12,12,20
7,Italy,6,34,45,43.0%,7.5%,110,2,0,0,...,20,74.1%,101,89,16,16,0,18,18,19
8,Netherlands,2,12,36,25.0%,4.1%,60,2,0,0,...,12,70.6%,35,30,3,5,0,7,7,15
9,Poland,2,15,23,39.4%,5.2%,48,0,0,0,...,6,66.7%,48,56,3,7,1,7,7,17
10,Portugal,6,22,42,34.3%,9.3%,82,6,0,0,...,10,71.5%,73,90,10,12,0,14,14,16
11,Republic of Ireland,1,7,12,36.8%,5.2%,28,0,0,0,...,17,65.4%,43,51,11,6,1,10,10,17
12,Russia,5,9,31,22.5%,12.5%,59,2,0,0,...,10,77.0%,34,43,4,6,0,7,7,16
13,Spain,12,42,33,55.9%,16.0%,100,0,1,0,...,15,93.8%,102,83,19,11,0,17,17,18
14,Sweden,5,17,19,47.2%,13.8%,39,3,0,0,...,8,61.6%,35,51,7,7,0,9,9,18
15,Ukraine,2,7,26,21.2%,6.0%,38,0,0,0,...,13,76.5%,48,31,4,5,0,9,9,18

In [42]:
df1.dtypes

Team                           object
Goals                           int64
Shots on target                 int64
Shots off target                int64
Shooting Accuracy              object
% Goals-to-shots               object
Total shots (inc. Blocked)      int64
Hit Woodwork                    int64
Penalty goals                   int64
Penalties not scored            int64
Headed goals                    int64
Passes                          int64
Passes completed                int64
Passing Accuracy               object
Touches                         int64
Crosses                         int64
Dribbles                        int64
Corners Taken                   int64
Tackles                         int64
Clearances                      int64
Interceptions                   int64
Clearances off line           float64
Clean Sheets                    int64
Blocks                          int64
Goals conceded                  int64
Saves made                      int64
Saves-to-shots ratio           object
Fouls Won                       int64
Fouls Conceded                  int64
Offsides                        int64
Yellow Cards                    int64
Red Cards                       int64
Subs on                         int64
Subs off                        int64
Players Used                    int64
dtype: object

In [39]:
str1 = "47.2%"
num1 = str1.replace("%", "")
num1 = float(num1)
type(num1), type(str1), num1

(float, str, 47.2)

In [45]:
df1['Shooting Accuracy'] = df1['Shooting Accuracy'].apply(lambda x: float(x.replace("%", "")))

In [53]:
df1[df1['Shooting Accuracy'] < 25]

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
12,Russia,5,9,31,22.5,12.5%,59,2,0,0,...,10,77.0%,34,43,4,6,0,7,7,16
15,Ukraine,2,7,26,21.2,6.0%,38,0,0,0,...,13,76.5%,48,31,4,5,0,9,9,18

In [ ]:
# map
# apply
# applymap
#

### Conditional Selection based on  Multiple Conditions
- Suppose we want to get all the records of the dataframe where the age value is greater than 20 and belong to Multan
- For this use multiple conditions inside parenthesis and use logical operators (`&`, `|`) in between
```
df[(condition1) op (condition2) op (condition3)]
```

In [54]:
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [55]:
mask = (df.age < 20) & (df.address != 'Multan')
mask
# Truth Table of AND operator
# T & T = T
# T & F = F
# F & T = F
# F & F = F

0     False
1      True
2     False
3     False
4     False
5      True
6      True
7     False
8      True
9      True
10     True
11    False
12     True
13    False
14     True
15    False
dtype: bool

In [56]:
df[mask]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
8,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0

In [57]:
df[(df.age < 20) & (df.address != 'Multan')]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
8,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0

In [58]:
df[(df.age < 20) & (df.address == 'Multan')]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
7,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [59]:
# Select records of group A male students only
df1 = df[(df.group == 'group A') & (df.gender == 'Male')]  
df1

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [60]:
# Select the records of students who belong to Sialkot or Karachi
df1 = df[(df.address == 'Sialkot') | (df.address == 'Karachi')]
df1

# Truth Table of OR operator
# T | T = T
# T | F = T
# F | T = T
# F | F = F

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
8,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0

In [61]:
# Select records who lives outside Karachi and earn a scholarship of greater than 7000, or lives in Peshawer
out = df[(df.address != 'Karachi') & (df.scholarship > 7000) | (df.address == 'Peshawer')]
out

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
7,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

**If there are many conditions connected with or operator, you can simplify it using the `series.isin()` method as shown below:**

In [62]:
df[df['address'].isin(['Sialkot', 'Karachi','Peshawer'])]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
8,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0

##  Selecting columns of a specific data type
- The `df.select_dtypes()` method is used to get a subset of the dataframe to select columns of a specific datatype(s) 
```
df.select_dtypes(include, exclude)
```

- `include` and `exclude` arguments can be scalar or list-like
- Atleast one of these parameters must be supplied

In [63]:
# Let us first check the data types of each column
df.dtypes

roll no          int64
name            object
age              int64
address         object
session         object
group           object
gender          object
subj1          float64
subj2          float64
scholarship    float64
dtype: object

In [64]:
# Select the columns with object (categorical) data type
df.select_dtypes(include=['object'])

        name    address    session    group  gender
0   Ehtisham     Lahore    MORNING  group C    Male
1     Ayesha  Islamabad        AFT  group A    Male
2        Ali    Karachi  AFTERNOON  group B  Female
3      Aisha     Lahore        MOR  group A    Male
4      Ahmed   Peshawer        AFT  group D  Female
5    Khadija     Lahore    MORNING  group C  Female
6       Omar    Sialkot        AFT  group B  Female
7      Adeen     Multan    MORNING  group D    Male
8     Zainab    Karachi        AFT  group C    Male
9     Hassan     Lahore  AFTERNOON  group D    Male
10   Hussein  Islamabad        MOR  group B    Male
11    Muskan    Karachi  AFTERNOON  group C    Male
12     Yusuf     Lahore    MORNING  group D    Male
13     Amina     Multan  AFTERNOON  group A  Female
14   Khubaib    Sialkot        AFT  group C  Female
15       Dua     Multan  AFTERNOON  group A    Male

In [65]:
# Select the columns with non-object (non-categorical) data type
df.select_dtypes(exclude=['object'])

    roll no  age  subj1  subj2  scholarship
0         1   23   78.3   84.4       5000.0
1         2   16   70.5   60.5       6000.0
2         3   20   64.9   75.1       8500.0
3         4   20   82.0   84.3       4000.0
4         5   21   65.9   72.8       3500.0
5         6   16   69.3   78.6          NaN
6         7   12   90.2    NaN       4000.0
7         8    4   84.1   76.0       8000.0
8         9   18   90.5   81.3       3500.0
9        10   15   90.5   81.3       3800.0
10       11   12   90.5   81.3       6000.0
11       12   20   90.5   81.3          NaN
12       13   18    NaN   76.5       7000.0
13       14   28   84.1   76.0       8000.0
14       15   13   90.5   81.3       3500.0
15       16   11   90.5   81.3       3800.0

In [66]:
# First Method: 
# Select the columns with integer (numerical) data type and float data type
df.select_dtypes(include=['int', 'float'])

    roll no  age  subj1  subj2  scholarship
0         1   23   78.3   84.4       5000.0
1         2   16   70.5   60.5       6000.0
2         3   20   64.9   75.1       8500.0
3         4   20   82.0   84.3       4000.0
4         5   21   65.9   72.8       3500.0
5         6   16   69.3   78.6          NaN
6         7   12   90.2    NaN       4000.0
7         8    4   84.1   76.0       8000.0
8         9   18   90.5   81.3       3500.0
9        10   15   90.5   81.3       3800.0
10       11   12   90.5   81.3       6000.0
11       12   20   90.5   81.3          NaN
12       13   18    NaN   76.5       7000.0
13       14   28   84.1   76.0       8000.0
14       15   13   90.5   81.3       3500.0
15       16   11   90.5   81.3       3800.0

In [67]:
# Second Method
# Select the columns with integer (numerical) data type USING np.number
import numpy as np
df.select_dtypes(include=np.number)

    roll no  age  subj1  subj2  scholarship
0         1   23   78.3   84.4       5000.0
1         2   16   70.5   60.5       6000.0
2         3   20   64.9   75.1       8500.0
3         4   20   82.0   84.3       4000.0
4         5   21   65.9   72.8       3500.0
5         6   16   69.3   78.6          NaN
6         7   12   90.2    NaN       4000.0
7         8    4   84.1   76.0       8000.0
8         9   18   90.5   81.3       3500.0
9        10   15   90.5   81.3       3800.0
10       11   12   90.5   81.3       6000.0
11       12   20   90.5   81.3          NaN
12       13   18    NaN   76.5       7000.0
13       14   28   84.1   76.0       8000.0
14       15   13   90.5   81.3       3500.0
15       16   11   90.5   81.3       3800.0

In [68]:
df['age'].select_dtypes(include=np.number)

AttributeError: 'Series' object has no attribute 'select_dtypes'

## Practice Questions

### Regiment
- A regiment is a military unit. Its role and size varies markedly, depending on the country, service and/or a specialisation.

#### Step 1. Import the necessary libraries

In [69]:
import pandas as pd
import numpy as np

#### Step 2. Create the `DataFrame` with the following values and Assign it to a variable called `regiment`.

In [71]:
# Create an example dataframe about a fictional army
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
            'deaths': [523, 52, 25, 616, 43, 234, 523, 62, 62, 73, 37, 35],
            'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
            'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
            'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
            'readiness': [1, 2, 3, 3, 2, 1, 2, 3, 2, 1, 2, 3],
            'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
            'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'origin': ['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska', 'Washington', 'Oregon', 'Wyoming', 'Louisana', 'Georgia']}
raw_data

{'regiment': ['Nighthawks',
  'Nighthawks',
  'Nighthawks',
  'Nighthawks',
  'Dragoons',
  'Dragoons',
  'Dragoons',
  'Dragoons',
  'Scouts',
  'Scouts',
  'Scouts',
  'Scouts'],
 'company': ['1st',
  '1st',
  '2nd',
  '2nd',
  '1st',
  '1st',
  '2nd',
  '2nd',
  '1st',
  '1st',
  '2nd',
  '2nd'],
 'deaths': [523, 52, 25, 616, 43, 234, 523, 62, 62, 73, 37, 35],
 'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
 'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
 'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
 'readiness': [1, 2, 3, 3, 2, 1, 2, 3, 2, 1, 2, 3],
 'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
 'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
 'origin': ['Arizona',
  'California',
  'Texas',
  'Florida',
  'Maine',
  'Iowa',
  'Alaska',
  'Washington',
  'Oregon',
  'Wyoming',
  'Louisana',
  'Georgia']}

In [72]:
# craete a dataframe from the raw data
regiment = pd.DataFrame(raw_data)
regiment.head()

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters,origin
0,Nighthawks,1st,523,5,1045,1,1,1,4,Arizona
1,Nighthawks,1st,52,42,957,5,2,0,24,California
2,Nighthawks,2nd,25,2,1099,62,3,1,31,Texas
3,Nighthawks,2nd,616,2,1400,26,3,1,2,Florida
4,Dragoons,1st,43,4,1592,73,2,0,3,Maine

### Description of the columns in the dataframe
- **regiment:** The name or identifier of the military unit.
- **company:** The specific company within the regiment.
- **deaths:** Number of soldiers who have died in battles.
- **battles:** Number of battles the regiment has participated in.
- **size:** Total size of the regiment, indicating the number of soldiers.
- **veterans(retired solider):** Number of experienced and seasoned soldiers.
- **readiness:** The state of preparedness or readiness of the regiment. (The country maintained a high level of military preparedness)
- **armored:(Bombproof)** Presence of armored units within the regiment.
- **deserters:** Number of soldiers who have deserted or abandoned their posts.
- **origin:** The origin or place of hiring for the regiment.

#### Step 3. Set the `origin` column as the index of the dataframe.

In [73]:
regiment['origin'].value_counts()

origin
Arizona       1
California    1
Texas         1
Florida       1
Maine         1
Iowa          1
Alaska        1
Washington    1
Oregon        1
Wyoming       1
Louisana      1
Georgia       1
Name: count, dtype: int64

In [74]:
regiment = regiment.set_index('origin')
regiment

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523,5,1045,1,1,1,4
California,Nighthawks,1st,52,42,957,5,2,0,24
Texas,Nighthawks,2nd,25,2,1099,62,3,1,31
Florida,Nighthawks,2nd,616,2,1400,26,3,1,2
Maine,Dragoons,1st,43,4,1592,73,2,0,3
Iowa,Dragoons,1st,234,7,1006,37,1,1,4
Alaska,Dragoons,2nd,523,8,987,949,2,0,24
Washington,Dragoons,2nd,62,3,849,48,3,1,31
Oregon,Scouts,1st,62,4,973,48,2,0,2
Wyoming,Scouts,1st,73,7,1005,435,1,0,3
Louisana,Scouts,2nd,37,8,1099,63,2,1,2
Georgia,Scouts,2nd,35,9,1523,345,3,1,3

#### Step 4. Print only the column `veterans`

In [75]:
regiment.columns

Index(['regiment', 'company', 'deaths', 'battles', 'size', 'veterans',
       'readiness', 'armored', 'deserters'],
      dtype='object')

In [76]:
regiment.veterans

origin
Arizona         1
California      5
Texas          62
Florida        26
Maine          73
Iowa           37
Alaska        949
Washington     48
Oregon         48
Wyoming       435
Louisana       63
Georgia       345
Name: veterans, dtype: int64

#### Step 5. Print the columns 'veterans' and 'deaths'

In [77]:
regiment.loc[:,['deaths', 'veterans']] # First Method

            deaths  veterans
origin
Arizona        523         1
California      52         5
Texas           25        62
Florida        616        26
Maine           43        73
Iowa           234        37
Alaska         523       949
Washington      62        48
Oregon          62        48
Wyoming         73       435
Louisana        37        63
Georgia         35       345

In [78]:
regiment[['deaths', 'veterans']] # Second Method]]

            deaths  veterans
origin
Arizona        523         1
California      52         5
Texas           25        62
Florida        616        26
Maine           43        73
Iowa           234        37
Alaska         523       949
Washington      62        48
Oregon          62        48
Wyoming         73       435
Louisana        37        63
Georgia         35       345

#### Step 6. Select the `deaths`,`size` and `deserters` columns from `Texas` and `Alaska`.

In [79]:
regiment.loc[['Texas', 'Alaska'],['deaths', 'size', 'deserters']]

        deaths  size  deserters
origin
Texas       25  1099         31
Alaska     523   987         24

#### Step 7. Select the rows 3 to 7 and the columns 3 to 6

In [80]:
regiment.iloc[3:7, 3:6]

         battles  size  veterans
origin
Florida        2  1400        26
Maine          4  1592        73
Iowa           7  1006        37
Alaska         8   987       949

#### Step 8. Select every row after the fourth row and all columns

In [81]:
regiment.iloc[::3, :]

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523,5,1045,1,1,1,4
Florida,Nighthawks,2nd,616,2,1400,26,3,1,2
Alaska,Dragoons,2nd,523,8,987,949,2,0,24
Wyoming,Scouts,1st,73,7,1005,435,1,0,3

#### Step 9. Select all the rows and the 3rd column up to the 7th column

In [82]:
regiment.iloc[:, 3:7]

            battles  size  veterans  readiness
origin
Arizona           5  1045         1          1
California       42   957         5          2
Texas             2  1099        62          3
Florida           2  1400        26          3
Maine             4  1592        73          2
Iowa              7  1006        37          1
Alaska            8   987       949          2
Washington        3   849        48          3
Oregon            4   973        48          2
Wyoming           7  1005       435          1
Louisana          8  1099        63          2
Georgia           9  1523       345          3

#### Step 10. Select rows where df.deaths is greater than 50

In [83]:
regiment[regiment['deaths'] > 50]

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523,5,1045,1,1,1,4
California,Nighthawks,1st,52,42,957,5,2,0,24
Florida,Nighthawks,2nd,616,2,1400,26,3,1,2
Iowa,Dragoons,1st,234,7,1006,37,1,1,4
Alaska,Dragoons,2nd,523,8,987,949,2,0,24
Washington,Dragoons,2nd,62,3,849,48,3,1,31
Oregon,Scouts,1st,62,4,973,48,2,0,2
Wyoming,Scouts,1st,73,7,1005,435,1,0,3

#### Step 11. Select rows where `df.deaths` is greater than 500 or less than 50.

In [84]:
regiment[(regiment['deaths'] > 500) | (regiment['deaths'] < 50)]

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523,5,1045,1,1,1,4
Texas,Nighthawks,2nd,25,2,1099,62,3,1,31
Florida,Nighthawks,2nd,616,2,1400,26,3,1,2
Maine,Dragoons,1st,43,4,1592,73,2,0,3
Alaska,Dragoons,2nd,523,8,987,949,2,0,24
Louisana,Scouts,2nd,37,8,1099,63,2,1,2
Georgia,Scouts,2nd,35,9,1523,345,3,1,3

#### Step 12. Select all the regiments not named `Dragoons`.

In [85]:
regiment[regiment['regiment'] != 'Dragoons']

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523,5,1045,1,1,1,4
California,Nighthawks,1st,52,42,957,5,2,0,24
Texas,Nighthawks,2nd,25,2,1099,62,3,1,31
Florida,Nighthawks,2nd,616,2,1400,26,3,1,2
Oregon,Scouts,1st,62,4,973,48,2,0,2
Wyoming,Scouts,1st,73,7,1005,435,1,0,3
Louisana,Scouts,2nd,37,8,1099,63,2,1,2
Georgia,Scouts,2nd,35,9,1523,345,3,1,3

#### Step 13. Select the rows called Texas and Arizona

In [86]:
regiment.loc[['Texas', 'Arizona'], :]

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Texas,Nighthawks,2nd,25,2,1099,62,3,1,31
Arizona,Nighthawks,1st,523,5,1045,1,1,1,4

## Check Your Concepts:
- What is Pandas?
- How to iterate over rows in Pandas Dataframe 
- Different ways to iterate over rows in Pandas Dataframe 
- Selecting rows in pandas DataFrame based on conditions 
- Select any row from a Dataframe using iloc[] and iat[] in Pandas 
- Limited rows selection with given column in Pandas | Python 
- Drop rows from the dataframe based on certain condition applied on a column 
- Insert row at given position in Pandas Dataframe 
- Create a list from rows in Pandas dataframe 
- Ranking Rows of Pandas DataFrame 
- Sorting rows in pandas DataFrame 
- Select row with maximum and minimum value in Pandas dataframe 
- Get all rows in a Pandas DataFrame containing given substring 
- Convert a column to row name/index in Pandas 
- How to randomly select rows from Pandas DataFrame

# Pandas - Assignment No 01
- Click here to solve [Pandas - Assignment no 01](https://www.kaggle.com/code/ehtishamsadiq/pandas-assignment-no-01)

In [2]:
from IPython.core.display import HTML

style = """
    <style>
        body {
            background-color: #f2fff2;
        }
        h1 {
            text-align: center;
            font-weight: bold;
            font-size: 36px;
            color: #4295F4;
            text-decoration: underline;
            padding-top: 15px;
        }
        
        h2 {
            text-align: left;
            font-weight: bold;
            font-size: 30px;
            color: #4A000A;
            text-decoration: underline;
            padding-top: 10px;
        }
        
        h3 {
            text-align: left;
            font-weight: bold;
            font-size: 30px;
            color: #f0081e;
            text-decoration: underline;
            padding-top: 5px;
        }

        
        p {
            text-align: center;
            font-size: 12 px;
            color: #0B9923;
        }
    </style>
"""

html_content = """
<h1>Hello</h1>
<p>Hello World</p>
<h2> Hello</h2>
<h3> World </h3>
"""

HTML(style + html_content)